evgmolt/Tonometer/gd32f303_v1/src/main.c
							count_send_bluetooth=0;
						
							current_pressure=0;
							i2c_calibration();
							PUMP_ON;
							VALVE_1_ON;
							VALVE_2_ON;
							_lockInterval=50;
							sector_start_scan=0;
							main_index = 0;		
							save_dir_counter=0;		
							Wave_detect_FLAG=0;	
							_maxD=0;		
							_detectLevel_comp_UP=15;
							_detectLevel=_detectLevel_start;
							silence_time_start=0;
							puls_counter=0;			
							detect_FLAG=0;
							timer_2_start();
							finish_6_flag=0;
							mode = PUMPING_MANAGEMENT;
							button_released = 0;
							button_pressed_counter = 0;
					}
					break;
				case KEY_OFF:
					device_OFF();
					break;
				case PUMPING_MANAGEMENT:
					ILI9341_FillRectangle(65, 245, 45, 27, ILI9341_WHITE);
					if (button_released) abort_meas();
					if (current_pressure>=0 & current_pressure<400) print_num_H(GetAver(current_pressure),235,120,GREEN);
				
					if (current_pressure >= MAX_ALLOWED_PRESSURE) {
							_detectLevel = _detectLevel_start;						
							main_index=0;		
							save_dir_counter=0;		
							Wave_detect_FLAG=0;	
							silence_time_start=0;
							_maxD=0;							
							puls_counter=0;						
							mode = MEASUREMENT;		
					}						
					break;
				case USB_CHARGING:
					if (gpio_input_bit_get(GPIOB, GPIO_PIN_8)==0) indicate_charge_toggle=1;
					print_bat_charg();				
					delay_1ms(2000);				
					if (gpio_input_bit_get(GPIOC, GPIO_PIN_10)==0) device_OFF();						
					break;
				case PRESSURE_TEST:
					convert_NO_save();
					print_num_H(current_pressure,235,10,YELLOW);
					//print_num_H(current_pressure,235,120,RED);
					usb_send_16(i2c_out,0);
					delay_1ms(200);
					print_time(rtc_counter_get());
					break;
				case MEASUREMENT:
					if (button_released) abort_meas();
					if (current_pressure>=0 & current_pressure<400) print_num_H(current_pressure,235,120,GREEN);
					PUMP_OFF;
					VALVE_2_OFF;
					if (main_index>1+size_pack*(count_send_bluetooth+1)){						
							uint8_t c_summ=0;							
							uint8_t cur_buff_ble[400]={'0','2',0x05,count_send_bluetooth&0xFF,(count_send_bluetooth>>8)&0xFF,size_pack};
							
							for (int f=0;f<size_pack;f++){
									int16_t cur_press=(((save_clear[count_send_bluetooth*size_pack+f]-i2c_out_K)*100)/rate);
									cur_buff_ble[6+f*2]=cur_press&0xFF;
									cur_buff_ble[6+f*2+1]=(cur_press>>8)&0xFF;
							}							
							for (int f=0;f<size_pack*2+6;f++){
									c_summ+=cur_buff_ble[f];
							}
							cur_buff_ble[size_pack*2+6]=c_summ;
							my_send_string_UART_0(cur_buff_ble,size_pack*2+6+1);
							count_send_bluetooth++;
					}
					if (current_pressure <= STOP_MEAS_LEVEL){
							//timer_2_stop();						                           ///////////////////////////////////////////////

  						for (int i = 0; i < AVER_SIZE; i++) {
								ArrayForAver[i] = 0;
							}
						
							ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
						
							str_clear(EnvelopeArray,10000);
							GetArrayOfWaveIndexes(save_dir, puls_buff, puls_buff_NEW);
							f_sorting_MAX();
							CountEnvelopeArray(puls_buff_NEW,puls_buff_AMP);
							f_PSys_Dia();
							puls_convert();	
							bonus_byte=0;
							if (main_index>1000 & PSys>10 & PSys<300 & PDia>10 & PDia<300 & puls_out>10 & puls_out<300) {
									ILI9341_DrawImage(5, 10, 46, 36, (const uint16_t*)SYS);
									ILI9341_DrawImage(5, 133, 45, 35, (const uint16_t*)DIA);	
									print_SIS(PSys);
									print_DIA(PDia);									
									print_num_H((int16_t)puls_out,235,250,BLACK);
								
									cur_tim = rtc_counter_get();
									m_hh = cur_tim / 3600;
									m_mm = (cur_tim % 3600) / 60;
									m_ss = (cur_tim % 3600) % 60;
									check_backup_register(&cur_day, &cur_month, &cur_year);
									if 	(cur_year>=255)	cur_year-=2000;
									//send_result_measurement(14, 15, 16, 17, 18, 19, 20, 21, 22, 23);																							
							}
							else {
									bonus_byte|=0x80;
									print_error(4);							
							}
							send_result_measurement((uint8_t)cur_day, (uint8_t)cur_month, (uint8_t)cur_year, (uint8_t)m_ss, (uint8_t)m_mm, (uint8_t)m_hh, (uint8_t)PSys, (uint8_t)PDia, (uint8_t)puls_out,bonus_byte);
							
							VALVE_1_OFF;
							VALVE_2_OFF;
							mode = SEND_SAVE_BUFF_MSG;								
							timer_1_start();
					}					
					break;
				case SEND_SAVE_BUFF_MSG:
					break;
			}
			
			if (UART0_flag==1){					
					for (int w=0;w<200;w++){
							if (finder_msg(UART0_buff)){																	
										ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_RED);															
							}
							if (finder(UART0_buff, "OFF",0,&num_string)) {
									ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_WHITE);
							}
					}
					UART0_flag=0;
			}
			
		//if (bluetooth_status) ILI9341_DrawImage(5, 255, 15, 24, (const uint16_t*)bluetooth);			
		//else ILI9341_FillRectangle(5, 255, 15, 24, ILI9341_WHITE);		
			
			if (Wave_ind_FLAG){				
					ILI9341_DrawImage(72, 279, 31, 30, (const uint16_t*)heart);
					delay_1ms(200);
					ILI9341_FillRectangle(72, 279, 31, 30, ILI9341_WHITE);
					Wave_ind_FLAG=0;
			}
						
			if (0U == cdc_acm_check_ready(&usbd_cdc)) {
					cdc_acm_data_receive(&usbd_cdc);
			} else {
					cdc_acm_data_send(&usbd_cdc);
			}			
    }
}

void abort_meas(void) {
		mode = START_SCREEN;
		PUMP_OFF;
		VALVE_1_OFF;
		VALVE_2_OFF;
		button_released = 0;
		button_pressed_counter = 0;
}

void print_num_H(int16_t num, uint16_t X0, uint16_t Y0, uint8_t color){
	double now=0;
	uint16_t now1=0;
	uint8_t max;
	if (num>=100)max=3;
	else if (num>=10) {
		max=2;
		if (color==BLACK) ILI9341_FillRectangle(X0-41*3, Y0, 41, 64, ILI9341_WHITE);
		else 							ILI9341_FillRectangle(X0-60*3, Y0, 60, 106, ILI9341_WHITE);
	}
	else {
		max=1;
		if (color==BLACK) ILI9341_FillRectangle(X0-41*3, Y0, 82, 64, ILI9341_WHITE);
		else 							ILI9341_FillRectangle(X0-60*3, Y0, 120, 106, ILI9341_WHITE);
	}
			
	for (int g=0;g<max;g++){
			now=pow(10,g);
			now1=now;			
			switch ((num/now1)%10)	{	
				case 0:					
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_0);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_0);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_0);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_0);
				break;
				case 1:
				 	if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_1);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_1);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_1);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_1);
				break;
				case 2:
				 	if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_2);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_2);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_2);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_2);
				break;
				case 3:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_3);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_3);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_3);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_3);
				break;
				case 4:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_4);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_4);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_4);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_4);
				break;
				case 5:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_5);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_5);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_5);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_5);
				break;
				case 6:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_6);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_6);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_6);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_6);
				break;
				case 7:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_7);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_7);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_7);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_7);
				break;
				case 8:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_8);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_8);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_8);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_8);
				break;
				case 9:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_9);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_9);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_9);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_9);
				break;
			}
	}
}

void i2c_config(void){
		/* enable GPIOB clock */
    rcu_periph_clock_enable(RCU_GPIOB);
		/* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);
	
	  /* connect PB6 to I2C0_SCL */
    /* connect PB7 to I2C0_SDA */
//  gpio_init(GPIOB, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
		gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
	
    /* cofigure I2C clock */
    i2c_clock_config(I2C0, 100000, I2C_DTCY_2);
    /* cofigure I2C address */
    i2c_mode_addr_config(I2C0, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C0_OWN_ADDRESS7);
    /* enable I2C0 */
    i2c_enable(I2C0);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
}

void SIM_recieve_OK(void){
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, "OK", 3);
}

void TFT_print(void){
		uint8_t buff[100]={0};
		uint16_t adc_1=0;
		uint8_t rang_bat=0;
	
