evgmolt/Tonometer/gd32f303_v1/src/main.c
		sprintf(buff,"%02d.",cur_day);
		ILI9341_WriteString(130, 260, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%02d.",cur_month);
		ILI9341_WriteString(160, 260, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%04d",cur_year);
		ILI9341_WriteString(190, 260, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
}

void time_set(uint32_t tmp_hh,uint32_t tmp_mm,uint32_t tmp_ss){
    rtc_configuration(); 

		rtc_lwoff_wait();
				
		rtc_counter_set((tmp_hh*3600 + tmp_mm*60 + tmp_ss));
		
		rtc_lwoff_wait();

    bkp_write_data(BKP_DATA_0, 0xA5A5);	
}

void time_init(void){
	if (bkp_read_data(BKP_DATA_0) != 0xA5A5){
				time_set(0, 0, 0);
  }
	else{
        /* check if the power on reset flag is set */
        if (rcu_flag_get(RCU_FLAG_PORRST) != RESET){}
				else if (rcu_flag_get(RCU_FLAG_SWRST) != RESET){}
        /* allow access to BKP domain */
        rcu_periph_clock_enable(RCU_PMU);
        pmu_backup_write_enable();       
        /* wait for RTC registers synchronization */
        rtc_register_sync_wait();
        /* enable the RTC second */
        rtc_interrupt_enable(RTC_INT_SECOND);
        /* wait until last write operation on RTC registers has finished */
        rtc_lwoff_wait();
  }	
  rcu_all_reset_flag_clear();
}

void i2c_init(void){
		/* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));		
		/* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

		i2c_data_transmit(I2C0, 0x01);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}
		i2c_data_transmit(I2C0, 0x8F);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}				
		i2c_data_transmit(I2C0,0xC3);//0x83);//0xC3); //0xA3);
		while(!i2c_flag_get(I2C0, I2C_FLAG_TBE)){}		
		
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(I2C0);
    /* wait until stop condition generate */
    while(I2C_CTL0(I2C0) & 0x0200);			
}

void i2c_print(void){
	uint8_t buff1[10]={0};
	i2c_convers();
	i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
	current_pressure=((((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K)/rate);
	sprintf(buff1,"%6d",i2c_out);
	sprintf(buff1,"%6d",current_pressure);
}

void button_interrupt_config(void){
		//nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
	
    /* enable the key user clock */
    rcu_periph_clock_enable(RCU_GPIOC);   
    
    /* configure button pin as input */
    //gpio_init(GPIOC, GPIO_MODE_IPD, GPIO_OSPEED_50MHZ, GPIO_PIN_8);
    
		/* enable the AF clock */
		rcu_periph_clock_enable(RCU_AF);	
	
    /* enable and set key user EXTI interrupt to the lowest priority */
		nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
    nvic_irq_enable(EXTI5_9_IRQn, 2U, 2U);

    /* connect key user EXTI line to key GPIO pin */
    gpio_exti_source_select(GPIO_PORT_SOURCE_GPIOC, GPIO_PIN_SOURCE_8);

    /* configure key user EXTI line */
    exti_init(EXTI_8, EXTI_INTERRUPT, EXTI_TRIG_BOTH );
    exti_interrupt_flag_clear(EXTI_8);
}

void set_FLAG(void){
		//ILI9341_FillRectangle(5, 70, 30, 30, ILI9341_BLACK);
		//uint8_t buff1[10]={0};
		//sprintf(buff1,"%6d",main_index);
		//ILI9341_WriteString(5, 90, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
}
void reset_FLAG(void){
		ILI9341_FillRectangle(5, 70, 30, 30, ILI9341_WHITE);
}
void device_OFF(void){
		PUMP_OFF;
		VALVE_1_OFF;
		VALVE_2_OFF;
		ILI9341_FillScreen(ILI9341_BLACK);
		gpio_bit_reset(GPIOC, GPIO_PIN_9);
}
void i2c_calibration(void){
		uint8_t buff1[10]={0};
		i2c_out_K=0;
		for (int g=0;g<20;g++){			
				while (ADS1115_read_IT()==0){}
				i2c_out_K+=((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF);				
		}
		i2c_out_K=i2c_out_K/20;
}

void usb_send_i2c_convers(void){
		i2c_convers();	
		uint8_t send_buff[3]={25,i2c_receiver[1],i2c_receiver[0]};
		i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		current_pressure=i2c_out/rate;
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
}

void timer_2_start(void){
		timer_interrupt_flag_clear(TIMER2, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(TIMER2, TIMER_INT_UP);
    timer_enable(TIMER2);
}
void timer_2_stop(void){
	timer_disable(TIMER2);			
}
void timer_1_start(void){
		timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(TIMER1, TIMER_INT_UP);
    timer_enable(TIMER1);
}
void timer_1_stop(void){
	timer_disable(TIMER1);			
}

uint8_t usb_send_save(int16_t *mass1, int16_t *mass2){
	for (int h=0;h<puls_counter;h++){
			if (send_counter==indexPSys | send_counter==indexPDia | send_counter==XMax)save_dir[send_counter]=1000;					
	}		
	
	uint8_t send_H1=(mass1[send_counter]>>8)&0xFF;
	uint8_t send_L1=mass1[send_counter]&0xFF;
	uint8_t send_H2=(mass2[send_counter]>>8)&0xFF;
	uint8_t send_L2=mass2[send_counter]&0xFF;
	
	uint8_t send_buff[5]={25,send_L1,send_H1,send_L2,send_H2};
	usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
	send_counter++;
	if (send_counter>=main_index) return 1;
	else return 0;
}

short int convert_save_16(void){			
		if (ADS1115_read_IT()==0) return 0;

		save_clear[main_index]=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		if (save_clear[main_index-1]<0) save_clear[main_index-1]=0;
		main_index++;			
		return 1;
}

short int convert_NO_save(void){			
		if (ADS1115_read_IT()==0) return 0;
		i2c_out=(((i2c_receiver[0]<<8)&0xFF00)+(i2c_receiver[1]&0xFF)-i2c_out_K);
		current_pressure=i2c_out/rate;	
		return i2c_out;
}

void usb_send_16(short int T1, short int T2){
		uint8_t send_H1=(T1>>8)&0xFF;
		uint8_t send_L1=T1&0xFF;
		uint8_t send_H2=(T2>>8)&0xFF;
		uint8_t send_L2=T2&0xFF;
		uint8_t send_buff[5]={25,send_L1,send_H1,send_L2,send_H2};
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 5);
}

