evgmolt/Tonometer/gd32f303_v1/src/main.c
uint8_t usb_send_slim_AMP(void){
	uint8_t send_H=(save_dir[send_counter]>>8)&0xFF;
	uint8_t send_L=save_dir[send_counter]&0xFF;
	uint8_t send_buff[3]={25,send_L,send_H};
	usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
	send_counter++;
	if (send_counter>=puls_counter) return 1;
	else return 0;
}


uint16_t puls_convert(void){
		double level = 0.06;
		uint16_t intervals[50]={0};
		uint8_t buff1[10]={0};
		double first_puls=0;
		int16_t cur_puls=0;
		puls_out=0;
		puls_cur_counter=0;
		if (puls_counter<10) return 0;
		for (int m=3;m<puls_counter-3;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit){
						first_puls+=cur_puls;
						puls_cur_counter++;
				}
		}		
		first_puls=first_puls/puls_cur_counter;
		//sprintf(buff1,"w-%3d",puls_cur_counter);
		//ILI9341_WriteString(1, 70, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		puls_cur_counter=0;
		for (int m=1;m<puls_counter;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit & cur_puls*1.5>first_puls & cur_puls/1.5<first_puls){
						puls_out+=cur_puls;
						intervals[puls_cur_counter]=cur_puls;
						puls_cur_counter++;	
				}
		}
		
		//sprintf(buff1,"c-%3d",puls_cur_counter);
		//ILI9341_WriteString(1, 90, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		
		double Aver=puls_out/puls_cur_counter;
		double TwentyFivePercent = Aver / 4;
		int Counter = 0;
    double SumSqr = 0;
		for (int i = 0; i < puls_cur_counter; i++){
				double Diff = intervals[i] - Aver;
				if (abs(Diff) < TwentyFivePercent){
						SumSqr += Diff * Diff;
						Counter++;
				}
    }
		//sprintf(buff1,"c-%3d",Counter);
		//ILI9341_WriteString(1, 110, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		double SKO = sqrt(SumSqr/Counter);
		if ((SKO/Aver)>level) {
				ILI9341_DrawImage(65, 245, 45, 27, (const uint16_t*)heartX3);
		}		
		
		puls_out=60/(puls_out/(puls_cur_counter*frequency));
		return puls_out;
}


void clear_monitor(void){
		ILI9341_FillRectangle(72, 279, 31, 30, ILI9341_WHITE);
		ILI9341_FillRectangle(5, 255, 15, 24, ILI9341_WHITE);
		ILI9341_FillRectangle(22, 258, 29, 18, ILI9341_WHITE);
		ILI9341_FillRectangle(65, 245, 45, 27, ILI9341_WHITE);
		ILI9341_FillRectangle(5, 10, 46, 36, ILI9341_WHITE);
		ILI9341_FillRectangle(5, 133, 45, 35, ILI9341_WHITE);				

		ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
		ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
		ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
}


void print_error(uint8_t K){
		ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
		ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
		ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
		uint8_t _buff[15]={0};
		if (K==2){
				sprintf(_buff,"majetta error");		
				ILI9341_WriteString(1, 30, _buff, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);			
		}
		if (K==3){
				sprintf(_buff,"time fail");		
				ILI9341_WriteString(1, 30, _buff, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);			
		}
		if (K==4){
				sprintf(_buff,"measurement error");		
				ILI9341_WriteString(1, 30, _buff, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);			
		}
		
}

uint8_t boot_mode(void){
		if (gpio_input_bit_get(GPIOB, GPIO_PIN_0)){     //
				delay_1ms(10);
				if (gpio_input_bit_get(GPIOC, GPIO_PIN_8)){
						gpio_bit_set(GPIOC, GPIO_PIN_9);	
						mode = INIT_START;
				}
				else if (gpio_input_bit_get(GPIOC, GPIO_PIN_10)){
						//gpio_bit_set(GPIOC, GPIO_PIN_9);	
						mode = USB_CHARGING;
				}
		}
}
void print_bat_charg(void){
		if(indicate_charge_toggle) {
						for (int i=1;i<6;i++){
						ILI9341_FillRectangle(200-i*29, 154, 25, 62, ILI9341_GREEN);						
				}					
				//ILI9341_FillRectangle(200-(rang_bat)*29, 154, 25, 62, ILI9341_GREEN);
				indicate_charge_toggle=0;
		}
		else {
				ILI9341_FillRectangle(52, 152, 146, 66, ILI9341_WHITE);
				indicate_charge_toggle=1;
		}
}
void bluetooth_init(void){
		//my_send_string_UART_0("AT\0\n",strlen("AT\0\n"));	
		//delay_1ms(1000);		
}
void bluetooth_check(void){
		if (finder(UART0_buff,"OK",0,0)) bluetooth_status=0;
		else bluetooth_status=1;	
		my_send_string_UART_0("AT\0\n",strlen("AT\0\n"));			
}

uint8_t finder(uint8_t *buff, uint8_t *_string, uint8_t _char, uint16_t *num){	
		uint8_t _flag=0;
		for (int j=0;j<200;j++){
				if (buff[j]==_string[0]){
						_flag=1;
						for (int k=0;k<strlen(_string);k++){
								if (buff[j+k]!=_string[k]) {
										_flag=0;
										k=strlen(_string);
								}									
						}						
				}
				if (_flag) {
						*num=j;
						buff[j]=_char;
						return 1;
				}
		}
		return 0;
}

uint8_t finder_msg(uint8_t *buff){	
		uint8_t cur_SERIAL[7]={0};
		uint8_t cur_buff[30]={'A','T','+','N','A','M','E','=','T','O','N','O','M'};
		uint8_t _flag=0;
		uint8_t _string[20]={'0','2'};

		//ILI9341_WriteString(1, 30, _string, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		for (int j=0;j<200;j++){
				if (buff[j]==_string[0] & buff[j+1]==_string[1]){
						_flag=1;												
				}
				if (_flag) {
						if (buff[j+2]==0x04){
								uint8_t check_sum=0;
								for (int a=0;a<10;a++){
										check_sum+=buff[j+a];
								}								
								if (buff[j+10]==check_sum){
										SERIAL[2]=cur_SERIAL[0]=buff[j+3];
										SERIAL[3]=cur_SERIAL[1]=buff[j+4];
										SERIAL[4]=cur_SERIAL[2]=buff[j+5];
										SERIAL[5]=cur_SERIAL[3]=buff[j+6];
										SERIAL[6]=cur_SERIAL[4]=buff[j+7];
										SERIAL[7]=cur_SERIAL[5]=buff[j+8];
										SERIAL[8]=cur_SERIAL[6]=buff[j+9];
										
										fmc_erase_pages();  
										fmc_program();						
									
										buff[j]=0xFF;
									
										delay_1ms(200);									
										device_OFF();
									
										return 1;
								}
						}
						else if (buff[j+2]==0x03){
								uint8_t check_sum=0;
								for (int a=0;a<10;a++){
										check_sum+=buff[j+a];
								}								
								if (buff[j+10]==check_sum){
										cur_day=cur_month=cur_month=cur_year=cur_tss=cur_tmm=cur_thh=0;
										cur_day=(uint16_t)buff[j+3];
										cur_month=(uint16_t)buff[j+4];
										cur_year=(uint16_t)(2000+buff[j+5]);
										cur_tss=(uint32_t)buff[j+6];
										cur_tmm=(uint32_t)buff[j+7];
										cur_thh=(uint32_t)buff[j+8];	
									
										time_set((uint32_t)cur_thh,(uint32_t)cur_tmm,(uint32_t)cur_tss);
										write_backup_register((uint16_t)cur_day, (uint16_t)cur_month, (uint16_t)cur_year);
		/*									
		uint8_t buff[100]={0};
		sprintf(buff,"%2d:",cur_thh);
		ILI9341_WriteString(130, 50, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%2d:",cur_tmm);
		ILI9341_WriteString(160, 50, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%2d",cur_tss);
		ILI9341_WriteString(190, 50, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);	
		
		sprintf(buff,"%2d.",cur_day);
		ILI9341_WriteString(130, 80, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%2d.",cur_month);
		ILI9341_WriteString(160, 80, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
		sprintf(buff,"%4d",cur_year);
		ILI9341_WriteString(190, 80, buff, Font_11x18, ILI9341_RED, ILI9341_WHITE);
*/
									
										buff[j]=0xFF;
										return 2;
								}
						}
				}
		}
		return 0;
}

void fmc_erase_pages(void){
    uint32_t EraseCounter;

    /* unlock the flash program/erase controller */
    fmc_unlock();

    /* clear all pending flags */
    fmc_flag_clear(FMC_FLAG_BANK0_END);
    fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
    fmc_flag_clear(FMC_FLAG_BANK0_PGERR);

    /* erase the flash pages */
    for(EraseCounter = 0; EraseCounter < PageNum; EraseCounter++){
        fmc_page_erase(FMC_WRITE_START_ADDR + (FMC_PAGE_SIZE * EraseCounter));
        fmc_flag_clear(FMC_FLAG_BANK0_END);
        fmc_flag_clear(FMC_FLAG_BANK0_WPERR);
        fmc_flag_clear(FMC_FLAG_BANK0_PGERR);
    }

